In [10]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# 10.3 두 Pandas DataFrame의 통합

## 10.3.1 Concatenating과 Combining - ~.concat(), ~.combine_first()

In [3]:
import pandas as pd
import numpy as np

In [4]:
df1 = pd.DataFrame({'이름': ['홍길동','최참판','성춘향'],
                    '보통예금': [1200,2300,1400],
                    '정기예금': [3400,2900,2600]},
                   index=[1012,1011,2010])

In [5]:
df1.index.name = 'ID'

In [8]:
df2 = pd.DataFrame({'이름': ['홍길동','이몽룡'],
                    '보통예금': [2100,3400],
                    '저축예금': [2700,4700]},
                   index=[1012,1010])
df2.index.name = 'ID'

In [11]:
df1;df2

       이름  보통예금  정기예금
ID
1012  홍길동  1200  3400
1011  최참판  2300  2900
2010  성춘향  1400  2600

       이름  보통예금  저축예금
ID
1012  홍길동  2100  2700
1010  이몽룡  3400  4700

같은 label을 가진 column이 있다면 같은 column으로 합성되고, 그렇지 않은 column들은 독립적으로 들어갔으며, 수직방향으로는 두 df-pds의 index들 중 서로 일치하는 것이 있든 말든 data row들이 합쳐지면서, 빈자리는 NaN으로 채워진다.

In [14]:
pd.concat([df1,df2],axis=1)

       이름    보통예금    정기예금   이름    보통예금    저축예금
ID
1010  NaN     NaN     NaN  이몽룡  3400.0  4700.0
1011  최참판  2300.0  2900.0  NaN     NaN     NaN
1012  홍길동  1200.0  3400.0  홍길동  2100.0  2700.0
2010  성춘향  1400.0  2600.0  NaN     NaN     NaN

동일한 index를 가진 data row들은 합쳐지고, 그렇지 않은 data row들은 독립적으로 들어갔으며, 두 df-pds의 column label중 서로 일치하는 것이 있든 말든 data row들이 합쳐지면서, 빈자리는 NaN으로 채워졌다.

In [15]:
pd.concat({'df1':df1, 'df2':df2}, axis=1)

      df1                  df2
       이름    보통예금    정기예금   이름    보통예금    저축예금
ID
1010  NaN     NaN     NaN  이몽룡  3400.0  4700.0
1011  최참판  2300.0  2900.0  NaN     NaN     NaN
1012  홍길동  1200.0  3400.0  홍길동  2100.0  2700.0
2010  성춘향  1400.0  2600.0  NaN     NaN     NaN

In [16]:
df1.combine_first(df2)

      보통예금   이름    저축예금    정기예금
ID
1010  3400  이몽룡  4700.0     NaN
1011  2300  최참판     NaN  2900.0
1012  1200  홍길동  2700.0  3400.0
2010  1400  성춘향     NaN  2600.0

 동일한 index를 가진 data row들이 하나의 data row로 합성되고, 그렇지 않은 data row들은 독립적으로 들어갔으며, 두 column label중 서로 일치하는 것이 있으면 하나의 column으로 합성되고, 그렇지 않은 column들은 독립적으로 들어갔다.
 어떤 자리에 두 df-pds중 하나만 값을 가지고 있다면 바로 그 값이 그 자리에 채워지고, 어떤 자리에 서로 다른 값을 가지고 있다면 그 자리는 df1의 값으로 채워자고, 어떤자리에 모두 값을 가지고 있지 않다면 NaN으로 채워진다.

In [17]:
df1.combine_first(df2).fillna(0) #NaN 값을 0으로 바꾼다.

      보통예금   이름    저축예금    정기예금
ID
1010  3400  이몽룡  4700.0     0.0
1011  2300  최참판     0.0  2900.0
1012  1200  홍길동  2700.0  3400.0
2010  1400  성춘향     0.0  2600.0

 따라서 pd.concat()함수와 ~.combine_first() method가 둘 다 확실히 의미있는 data 통합결과를 보여주는 경우는, 두 df가 index들끼리는 전혀 중복되지 않으면서 그 column label끼리는 완벽하게 일치하는 경우 뿐이다.

In [22]:
import pandas as pd

file_nos = [1,2,3]
n = 0
for file_no in file_nos:
    filename = f'grade0{file_no}.csv'
    dfn = pd.read_csv(filename)
    dfn['Class'] = file_no
    if n == 0: dfs = dfn
    else: dfs = pd.concat([dfs, dfn], ignore_index=True) #기존 index무시 0부터 새로붙임
    n = n+1
print(dfs)

      Name  Math  Physics Gender  Class  Python   C++
0  Charley  90.0     86.0      M      1     NaN   NaN
1  Jessica  85.0     90.0      F      1     NaN   NaN
2     Anna  72.0     83.0      F      1     NaN   NaN
3      Ted  92.0      NaN      M      2    65.0   NaN
4     Jane  68.0      NaN      F      2    88.0   NaN
5     John   NaN     59.0      M      3     NaN  83.0
6   Olivia   NaN     64.0      F      3     NaN  71.0

In [24]:
import pandas as pd

file_nos = [1,2,3]
dfns = []
for file_no in file_nos:
    filename = f'grade0{file_no}.csv'
    dfn = pd.read_csv(filename)
    dfn['Class'] = file_no
    dfns.append(dfn)
    
dfs = pd.concat(dfns, ignore_index=True)
print(dfs)

      Name  Math  Physics Gender  Class  Python   C++
0  Charley  90.0     86.0      M      1     NaN   NaN
1  Jessica  85.0     90.0      F      1     NaN   NaN
2     Anna  72.0     83.0      F      1     NaN   NaN
3      Ted  92.0      NaN      M      2    65.0   NaN
4     Jane  68.0      NaN      F      2    88.0   NaN
5     John   NaN     59.0      M      3     NaN  83.0
6   Olivia   NaN     64.0      F      3     NaN  71.0

In [26]:
import pandas as pd

file_nos = [1,2,3]
dfns = []
for file_no in file_nos:
    filename = f'grade0{file_no}.csv'
    dfn = pd.read_csv(filename, index_col=['Name']) #index값으로 'Name' column 가져오기
    dfn['Class'] = file_no
    dfns.append(dfn)
    
dfs2 = pd.concat(dfns, ignore_index=False)
print(dfs2)
foname = 'grade_out.csv'
dfs2.to_csv(foname, sep=',', index=True)

         Math  Physics Gender  Class  Python   C++
Name
Charley  90.0     86.0      M      1     NaN   NaN
Jessica  85.0     90.0      F      1     NaN   NaN
Anna     72.0     83.0      F      1     NaN   NaN
Ted      92.0      NaN      M      2    65.0   NaN
Jane     68.0      NaN      F      2    88.0   NaN
John      NaN     59.0      M      3     NaN  83.0
Olivia    NaN     64.0      F      3     NaN  71.0

## 10.3.2 Merging과 Joining - ~.merge(), ~.join()

In [27]:
df1 = pd.DataFrame({'ID': [1012,1011,2010],
                    '이름': ['홍길동','최참판','성춘향'],
                    '보통예금': [1200,2300,1400],
                    '정기예금': [3400,2900,2600]})

df2 = pd.DataFrame({'ID': [1012,1010],
                    '이름': ['홍길동','이몽룡'],
                    '보통예금': [2100,3400],
                    '저축예금': [2700,4700]})

In [30]:
df1.merge(df2, on=('ID','이름'), how='outer', suffixes=('_1','_2'))

     ID   이름  보통예금_1    정기예금  보통예금_2    저축예금
0  1012  홍길동  1200.0  3400.0  2100.0  2700.0
1  1011  최참판  2300.0  2900.0     NaN     NaN
2  2010  성춘향  1400.0  2600.0     NaN     NaN
3  1010  이몽룡     NaN     NaN  3400.0  4700.0

on=(): 통합 기준이 되는 column
how='outer': 통합이 합집합으로 data를 모두 포함
suffixes=(): 통합 기준이된 column을 제외한 공통된 column label을 구분해주기 위해 어미를 붙임

In [31]:
pd.merge(df1, df2, on=('ID','이름'), how='outer', suffixes=('_1','_2'))
#같은결과

     ID   이름  보통예금_1    정기예금  보통예금_2    저축예금
0  1012  홍길동  1200.0  3400.0  2100.0  2700.0
1  1011  최참판  2300.0  2900.0     NaN     NaN
2  2010  성춘향  1400.0  2600.0     NaN     NaN
3  1010  이몽룡     NaN     NaN  3400.0  4700.0

~.merge() 함수는 두 개의 df-pds가 통합기준이 일부 중복되면서도 일치하지는 않은 경우에 그 둘을 대조 검토하는 목적으로 사용하기 적절하다.